iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
};

#define ADC0 (*(volatile struct ADC0_tag *) 0x4003b000)

struct ADC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1D;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1F;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1G;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1I;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1J;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1K;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1M;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1N;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1O;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t reservedSpace0:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADICLK:2;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t ADIV:2;
      uint64_t reservedSpace1:1;
      uint64_t CLRLTRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPLTS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RJ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFSEL:2;
      uint64_t DMAEN:1;
      uint64_t ACREN:1;
      uint64_t ACFGT:1;
      uint64_t ACFE:1;
      uint64_t ADTRG:1;
      uint64_t ADACT:1;
      uint64_t reservedSpace0:5;
      uint64_t TRGPRNUM:2;
      uint64_t reservedSpace1:1;
      uint64_t TRGSTLAT:4;
      uint64_t reservedSpace2:4;
      uint64_t TRGSTERR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVGS:2;
      uint64_t AVGE:1;
      uint64_t ADCO:1;
      uint64_t reservedSpace0:3;
      uint64_t CAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BA_OFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_BASE_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USR_OFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_USR_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOFS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_XOFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YOFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_YOFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_G;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UG:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_UG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPS:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP3:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP1:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPX:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLPX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP9:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPS_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLPS_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP3_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP3_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP2_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP2_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP1_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP1_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP0_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP0_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPX_OFS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLPX_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP9_OFS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP9_OFS;

