iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
};

#define PORTD (*(volatile struct PORTD_tag *) 0x4004c000)

struct PORTE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:4;
      uint64_t DSE:1;
      uint64_t reservedSpace1:1;
      uint64_t MUX:3;
      uint64_t reservedSpace2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace3:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:4;
      uint64_t DSE:1;
      uint64_t reservedSpace1:1;
      uint64_t MUX:3;
      uint64_t reservedSpace2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace3:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_PCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_GPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_GPCHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIWE:16;
      uint64_t GIWD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_GICLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIWE:16;
      uint64_t GIWD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_GICHR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_ISFR;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_DFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_DFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTE_DFWR;

