iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
};

#define PORTE (*(volatile struct PORTE_tag *) 0x4004d000)

struct WDOG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP:1;
      uint64_t WAIT:1;
      uint64_t DBG:1;
      uint64_t TST:2;
      uint64_t UPDATE:1;
      uint64_t INT:1;
      uint64_t EN:1;
      uint64_t CLK:2;
      uint64_t RCS:1;
      uint64_t ULK:1;
      uint64_t PRES:1;
      uint64_t CMD32EN:1;
      uint64_t FLG:1;
      uint64_t WIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDOG_CS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTLOW:8;
      uint64_t CNTHIGH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDOG_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOVALLOW:8;
      uint64_t TOVALHIGH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDOG_TOVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINLOW:8;
      uint64_t WINHIGH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDOG_WIN;

};

#define WDOG (*(volatile struct WDOG_tag *) 0x40052000)

struct FLEXIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTER:8;
      uint64_t TIMER:8;
      uint64_t PIN:8;
      uint64_t TRIGGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXEN:1;
      uint64_t SWRST:1;
      uint64_t FASTACC:1;
      uint64_t reservedSpace0:27;
      uint64_t DBGE:1;
      uint64_t DOZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_PIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSIE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTSIEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEIE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTEIEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMIEN;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSDE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTSDEN;

  uint8_t res2[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTCTL3;

  uint8_t res3[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTCFG3;

  uint8_t res4[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUF3;

  uint8_t res5[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBIS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBIS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBIS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBIS3;

