iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
  uint8_t res6[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBYS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBYS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBYS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBYS3;

  uint8_t res7[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBBS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBBS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBBS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_SHIFTBUFBBS3;

  uint8_t res8[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:2;
      uint64_t reservedSpace0:5;
      uint64_t PINPOL:1;
      uint64_t PINSEL:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:2;
      uint64_t reservedSpace0:5;
      uint64_t PINPOL:1;
      uint64_t PINSEL:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:2;
      uint64_t reservedSpace0:5;
      uint64_t PINPOL:1;
      uint64_t PINSEL:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:2;
      uint64_t reservedSpace0:5;
      uint64_t PINPOL:1;
      uint64_t PINSEL:3;
      uint64_t reservedSpace1:5;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCTL3;

  uint8_t res9[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:2;
      uint64_t reservedSpace6:2;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:2;
      uint64_t reservedSpace6:2;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:2;
      uint64_t reservedSpace6:2;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:2;
      uint64_t reservedSpace6:2;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCFG3;

  uint8_t res10[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCMP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLEXIO_TIMCMP3;

};

#define FLEXIO (*(volatile struct FLEXIO_tag *) 0x4005a000)

struct EWM_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t EWMEN:1;
      uint64_t ASSIN:1;
      uint64_t INEN:1;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SERVICE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_SERV;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPAREL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_CMPL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPAREH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_CMPH;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLK_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_CLKPRESCALER;

