iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
};

#define EWM (*(volatile struct EWM_tag *) 0x40061000)

struct TRGMUX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_DMAMUX0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_EXTOUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_EXTOUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_ADC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_ADC1;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_CMP0;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_PDB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_PDB1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FLEXIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:2;
      uint64_t SEL1:6;
      uint64_t reservedSpace1:2;
      uint64_t SEL2:6;
      uint64_t reservedSpace2:2;
      uint64_t SEL3:6;
      uint64_t reservedSpace3:1;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPIT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPUART0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPUART1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPI2C0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPSPI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPSPI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:6;
      uint64_t reservedSpace0:25;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPTMR0;

