iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
};

#define TRGMUX (*(volatile struct TRGMUX_tag *) 0x40063000)

struct SCG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VERSION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKPRES:8;
      uint64_t reservedSpace0:19;
      uint64_t DIVPRES:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_PARAM;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSLOW:4;
      uint64_t DIVBUS:4;
      uint64_t reservedSpace0:8;
      uint64_t DIVCORE:4;
      uint64_t reservedSpace1:4;
      uint64_t SCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSLOW:4;
      uint64_t DIVBUS:4;
      uint64_t reservedSpace0:8;
      uint64_t DIVCORE:4;
      uint64_t reservedSpace1:4;
      uint64_t SCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSLOW:4;
      uint64_t DIVBUS:4;
      uint64_t reservedSpace0:8;
      uint64_t DIVCORE:4;
      uint64_t reservedSpace1:4;
      uint64_t SCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_VCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSLOW:4;
      uint64_t DIVBUS:4;
      uint64_t reservedSpace0:8;
      uint64_t DIVCORE:4;
      uint64_t reservedSpace1:4;
      uint64_t SCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_HCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CLKOUTSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_CLKOUTCNFG;

  uint8_t res1[220];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCEN:1;
      uint64_t reservedSpace0:15;
      uint64_t SOSCCM:1;
      uint64_t SOSCCMRE:1;
      uint64_t reservedSpace1:5;
      uint64_t LK:1;
      uint64_t SOSCVLD:1;
      uint64_t SOSCSEL:1;
      uint64_t SOSCERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SOSCCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCDIV1:3;
      uint64_t reservedSpace0:5;
      uint64_t SOSCDIV2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SOSCDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EREFS:1;
      uint64_t HGO:1;
      uint64_t RANGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SOSCCFG;

  uint8_t res2[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIRCEN:1;
      uint64_t SIRCSTEN:1;
      uint64_t SIRCLPEN:1;
      uint64_t reservedSpace0:20;
      uint64_t LK:1;
      uint64_t SIRCVLD:1;
      uint64_t SIRCSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SIRCCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIRCDIV1:3;
      uint64_t reservedSpace0:5;
      uint64_t SIRCDIV2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SIRCDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SIRCCFG;

  uint8_t res3[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRCEN:1;
      uint64_t reservedSpace0:2;
      uint64_t FIRCREGOFF:1;
      uint64_t reservedSpace1:19;
      uint64_t LK:1;
      uint64_t FIRCVLD:1;
      uint64_t FIRCSEL:1;
      uint64_t FIRCERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_FIRCCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRCDIV1:3;
      uint64_t reservedSpace0:5;
      uint64_t FIRCDIV2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_FIRCDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_FIRCCFG;

  uint8_t res4[756];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPLLEN:1;
      uint64_t reservedSpace0:15;
      uint64_t SPLLCM:1;
      uint64_t SPLLCMRE:1;
      uint64_t reservedSpace1:5;
      uint64_t LK:1;
      uint64_t SPLLVLD:1;
      uint64_t SPLLSEL:1;
      uint64_t SPLLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SPLLCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPLLDIV1:3;
      uint64_t reservedSpace0:5;
      uint64_t SPLLDIV2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SPLLDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PREDIV:3;
      uint64_t reservedSpace1:5;
      uint64_t MULT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SPLLCFG;

};

#define SCG (*(volatile struct SCG_tag *) 0x40064000)

struct PCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_DMAMUX;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FlexCAN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FlexCAN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_ADC1;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FlexCAN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPSPI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPSPI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPSPI2;

