iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKLO:6;
      uint64_t reservedSpace0:2;
      uint64_t CLKHI:6;
      uint64_t reservedSpace1:2;
      uint64_t SETHOLD:6;
      uint64_t reservedSpace2:2;
      uint64_t DATAVD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_MCCR0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKLO:6;
      uint64_t reservedSpace0:2;
      uint64_t CLKHI:6;
      uint64_t reservedSpace1:2;
      uint64_t SETHOLD:6;
      uint64_t reservedSpace2:2;
      uint64_t DATAVD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_MCCR1;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXWATER:2;
      uint64_t reservedSpace0:14;
      uint64_t RXWATER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_MFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCOUNT:3;
      uint64_t reservedSpace0:13;
      uint64_t RXCOUNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_MFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t CMD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_MTDR;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t reservedSpace0:6;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_MRDR;

  uint8_t res6[156];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEN:1;
      uint64_t RST:1;
      uint64_t reservedSpace0:2;
      uint64_t FILTEN:1;
      uint64_t FILTDZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDF:1;
      uint64_t RDF:1;
      uint64_t AVF:1;
      uint64_t TAF:1;
      uint64_t reservedSpace0:4;
      uint64_t RSF:1;
      uint64_t SDF:1;
      uint64_t BEF:1;
      uint64_t FEF:1;
      uint64_t AM0F:1;
      uint64_t AM1F:1;
      uint64_t GCF:1;
      uint64_t SARF:1;
      uint64_t reservedSpace1:8;
      uint64_t SBF:1;
      uint64_t BBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDIE:1;
      uint64_t RDIE:1;
      uint64_t AVIE:1;
      uint64_t TAIE:1;
      uint64_t reservedSpace0:4;
      uint64_t RSIE:1;
      uint64_t SDIE:1;
      uint64_t BEIE:1;
      uint64_t FEIE:1;
      uint64_t AM0IE:1;
      uint64_t AM1F:1;
      uint64_t GCIE:1;
      uint64_t SARIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDDE:1;
      uint64_t RDDE:1;
      uint64_t AVDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SDER;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRSTALL:1;
      uint64_t RXSTALL:1;
      uint64_t TXDSTALL:1;
      uint64_t ACKSTALL:1;
      uint64_t reservedSpace0:4;
      uint64_t GCEN:1;
      uint64_t SAEN:1;
      uint64_t TXCFG:1;
      uint64_t RXCFG:1;
      uint64_t IGNACK:1;
      uint64_t HSMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADDRCFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SCFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKHOLD:4;
      uint64_t reservedSpace0:4;
      uint64_t DATAVD:6;
      uint64_t reservedSpace1:2;
      uint64_t FILTSCL:4;
      uint64_t reservedSpace2:4;
      uint64_t FILTSDA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SCFGR2;

  uint8_t res8[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADDR0:10;
      uint64_t reservedSpace1:6;
      uint64_t ADDR1:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SAMR;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RADDR:11;
      uint64_t reservedSpace0:3;
      uint64_t ANV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_STAR;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_STDR;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
      uint64_t reservedSpace0:6;
      uint64_t RXEMPTY:1;
      uint64_t SOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C0_SRDR;

};

#define LPI2C0 (*(volatile struct LPI2C0_tag *) 0x40066000)

struct LPUART0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFIFO:8;
      uint64_t RXFIFO:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_GLOBAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_PINCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBR:13;
      uint64_t SBNS:1;
      uint64_t RXEDGIE:1;
      uint64_t LBKDIE:1;
      uint64_t RESYNCDIS:1;
      uint64_t BOTHEDGE:1;
      uint64_t MATCFG:2;
      uint64_t RIDMAE:1;
      uint64_t RDMAE:1;
      uint64_t reservedSpace0:1;
      uint64_t TDMAE:1;
      uint64_t OSR:5;
      uint64_t M10:1;
      uint64_t MAEN2:1;
      uint64_t MAEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t MA2F:1;
      uint64_t MA1F:1;
      uint64_t PF:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t OR:1;
      uint64_t IDLE:1;
      uint64_t RDRF:1;
      uint64_t TC:1;
      uint64_t TDRE:1;
      uint64_t RAF:1;
      uint64_t LBKDE:1;
      uint64_t BRK13:1;
      uint64_t RWUID:1;
      uint64_t RXINV:1;
      uint64_t MSBF:1;
      uint64_t RXEDGIF:1;
      uint64_t LBKDIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PT:1;
      uint64_t PE:1;
      uint64_t ILT:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t RSRC:1;
      uint64_t DOZEEN:1;
      uint64_t LOOPS:1;
      uint64_t IDLECFG:3;
      uint64_t M7:1;
      uint64_t reservedSpace0:2;
      uint64_t MA2IE:1;
      uint64_t MA1IE:1;
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t ILIE:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TIE:1;
      uint64_t PEIE:1;
      uint64_t FEIE:1;
      uint64_t NEIE:1;
      uint64_t ORIE:1;
      uint64_t TXINV:1;
      uint64_t TXDIR:1;
      uint64_t R9T8:1;
      uint64_t R8T9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R0T0:1;
      uint64_t R1T1:1;
      uint64_t R2T2:1;
      uint64_t R3T3:1;
      uint64_t R4T4:1;
      uint64_t R5T5:1;
      uint64_t R6T6:1;
      uint64_t R7T7:1;
      uint64_t R8T8:1;
      uint64_t R9T9:1;
      uint64_t reservedSpace0:1;
      uint64_t IDLINE:1;
      uint64_t RXEMPT:1;
      uint64_t FRETSC:1;
      uint64_t PARITYE:1;
      uint64_t NOISY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MA1:10;
      uint64_t reservedSpace0:6;
      uint64_t MA2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_MATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTSE:1;
      uint64_t TXRTSE:1;
      uint64_t TXRTSPOL:1;
      uint64_t RXRTSE:1;
      uint64_t TXCTSC:1;
      uint64_t TXCTSSRC:1;
      uint64_t reservedSpace0:2;
      uint64_t RTSWATER:2;
      uint64_t reservedSpace1:6;
      uint64_t TNP:2;
      uint64_t IREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_MODIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFIFOSIZE:3;
      uint64_t RXFE:1;
      uint64_t TXFIFOSIZE:3;
      uint64_t TXFE:1;
      uint64_t RXUFE:1;
      uint64_t TXOFE:1;
      uint64_t RXIDEN:3;
      uint64_t reservedSpace0:1;
      uint64_t RXFLUSH:1;
      uint64_t TXFLUSH:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t reservedSpace1:4;
      uint64_t RXEMPT:1;
      uint64_t TXEMPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_FIFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXWATER:2;
      uint64_t reservedSpace0:6;
      uint64_t TXCOUNT:3;
      uint64_t reservedSpace1:5;
      uint64_t RXWATER:2;
      uint64_t reservedSpace2:6;
      uint64_t RXCOUNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART0_WATER;

