iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
};

#define LPUART2 (*(volatile struct LPUART2_tag *) 0x4006c000)

struct CMP0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HYSTCTR:2;
      uint64_t OFFSET:1;
      uint64_t reservedSpace0:1;
      uint64_t FILTER_CNT:3;
      uint64_t reservedSpace1:1;
      uint64_t EN:1;
      uint64_t OPE:1;
      uint64_t COS:1;
      uint64_t INVT:1;
      uint64_t PMODE:1;
      uint64_t reservedSpace2:1;
      uint64_t WE:1;
      uint64_t SE:1;
      uint64_t FPR:8;
      uint64_t COUT:1;
      uint64_t CFF:1;
      uint64_t CFR:1;
      uint64_t IEF:1;
      uint64_t IER:1;
      uint64_t reservedSpace3:1;
      uint64_t DMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP0_C0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VOSEL:8;
      uint64_t MSEL:3;
      uint64_t PSEL:3;
      uint64_t VRSEL:1;
      uint64_t DACEN:1;
      uint64_t CHN0:1;
      uint64_t CHN1:1;
      uint64_t CHN2:1;
      uint64_t CHN3:1;
      uint64_t CHN4:1;
      uint64_t CHN5:1;
      uint64_t CHN6:1;
      uint64_t CHN7:1;
      uint64_t INNSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t INPSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP0_C1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACOn:8;
      uint64_t INITMOD:6;
      uint64_t NSAM:2;
      uint64_t CH0F:1;
      uint64_t CH1F:1;
      uint64_t CH2F:1;
      uint64_t CH3F:1;
      uint64_t CH4F:1;
      uint64_t CH5F:1;
      uint64_t CH6F:1;
      uint64_t CH7F:1;
      uint64_t reservedSpace0:1;
      uint64_t FXMXCH:3;
      uint64_t reservedSpace1:1;
      uint64_t FXMP:1;
      uint64_t RRIE:1;
      uint64_t RRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP0_C2;

};

#define CMP0 (*(volatile struct CMP0_tag *) 0x40073000)

struct PMC_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LVDRE:1;
      uint64_t LVDIE:1;
      uint64_t LVDACK:1;
      uint64_t LVDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_LVDSC1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t LVWIE:1;
      uint64_t LVWACK:1;
      uint64_t LVWF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_LVDSC2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BIASEN:1;
      uint64_t CLKBIASDIS:1;
      uint64_t REGFPM:1;
      uint64_t reservedSpace0:3;
      uint64_t LPOSTAT:1;
      uint64_t LPODIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_REGSC;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LPOTRIM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_LPOTRIM;

};

#define PMC (*(volatile struct PMC_tag *) 0x4007d000)

struct SMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHSRUN:1;
      uint64_t reservedSpace0:2;
      uint64_t ELLS:1;
      uint64_t reservedSpace1:1;
      uint64_t ELLS2:1;
      uint64_t EVLLS0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t AVLP:1;
      uint64_t reservedSpace1:1;
      uint64_t AHSRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PMPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOPM:3;
      uint64_t VLPSA:1;
      uint64_t reservedSpace0:1;
      uint64_t RUNM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t STOPO:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_STOPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMSTAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PMSTAT;

};

#define SMC (*(volatile struct SMC_tag *) 0x4007e000)

struct RCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWAKEUP:1;
      uint64_t ELVD:1;
      uint64_t ELOC:1;
      uint64_t ELOL:1;
      uint64_t reservedSpace0:1;
      uint64_t EWDOG:1;
      uint64_t EPIN:1;
      uint64_t EPOR:1;
      uint64_t EJTAG:1;
      uint64_t ELOCKUP:1;
      uint64_t ESW:1;
      uint64_t EMDM_AP:1;
      uint64_t reservedSpace1:1;
      uint64_t ESACKERR:1;
      uint64_t reservedSpace2:1;
      uint64_t ETAMPER:1;
      uint64_t ECORE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LVD:1;
      uint64_t LOC:1;
      uint64_t LOL:1;
      uint64_t reservedSpace1:1;
      uint64_t WDOG_bitfield:1;
      uint64_t PIN:1;
      uint64_t POR:1;
      uint64_t JTAG:1;
      uint64_t LOCKUP:1;
      uint64_t SW:1;
      uint64_t MDM_AP:1;
      uint64_t reservedSpace2:1;
      uint64_t SACKERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_SRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTFLTSRW:2;
      uint64_t RSTFLTSS:1;
      uint64_t reservedSpace0:5;
      uint64_t RSTFLTSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_RPC;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SLVD:1;
      uint64_t SLOC:1;
      uint64_t SLOL:1;
      uint64_t reservedSpace1:1;
      uint64_t SWDOG:1;
      uint64_t SPIN:1;
      uint64_t SPOR:1;
      uint64_t SJTAG:1;
      uint64_t SLOCKUP:1;
      uint64_t SSW:1;
      uint64_t SMDM_AP:1;
      uint64_t reservedSpace2:1;
      uint64_t SSACKERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_SSRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DELAY:2;
      uint64_t LOC:1;
      uint64_t LOL:1;
      uint64_t reservedSpace0:1;
      uint64_t WDOG_bitfield:1;
      uint64_t PIN:1;
      uint64_t GIE:1;
      uint64_t JTAG:1;
      uint64_t LOCKUP:1;
      uint64_t SW:1;
      uint64_t MDM_AP:1;
      uint64_t reservedSpace1:1;
      uint64_t SACKERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_SRIE;

