iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K144/targetInit/s32k144_sfr.h
};

#define S32_SCB (*(volatile struct S32_SCB_tag *) 0xe000e008)

struct S32_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define S32_SysTick (*(volatile struct S32_SysTick_tag *) 0xe000e010)

struct S32_NVIC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICISER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICISER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICISER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICISER3;

  uint8_t res0[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICICER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICICER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICICER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICICER3;

  uint8_t res1[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICISPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICISPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICISPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICISPR3;

  uint8_t res2[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICICPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICICPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICICPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICICPR3;

  uint8_t res3[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICIABR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICIABR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICIABR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICIABR3;

  uint8_t res4[240];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI5:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI9:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI10:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI12:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI13:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI14:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI16:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI17:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI18:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI19:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI20:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI21:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI22:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI23:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI24:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI25:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI26:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI27:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI28:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI29:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI30:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI31:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI32:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP32;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI33:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI34:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI35:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI36:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI37:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI38:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP38;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI39:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP39;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI40:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI41:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI42:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI43:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI44:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI45:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI46:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI47:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI48:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI49:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI50:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI51:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI52:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI53:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI54:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI55:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI56:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI57:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI58:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI59:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI60:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI61:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI62:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI63:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI64:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI65:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI66:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI67:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI68:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI69:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI70:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI71:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI72:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI73:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI74:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI75:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI76:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI77:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI78:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI79:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI80:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI81:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI82:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI83:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI84:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI85:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI86:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI87:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI88:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI89:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI90:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI91:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI92:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI93:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI94:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI95:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI96:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI97:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI98:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI99:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI100:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI101:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP101;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI102:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP102;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI103:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP103;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI104:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP104;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI105:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP105;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI106:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP106;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI107:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP107;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI108:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP108;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI109:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP109;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI110:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP110;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI111:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP111;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI112:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP112;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI113:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP113;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI114:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP114;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI115:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP115;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI116:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP116;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI117:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP117;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI118:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP118;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI119:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP119;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI120:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP120;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI121:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP121;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI122:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NVICIP122;

  uint8_t res5[2693];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTID:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVICSTIR;

